<?php

use Illuminate\Database\Seeder;

class PagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            ['template_id' => '1', 'slug' => 'home'], //1
            ['template_id' => '2', 'slug' => 'services'], //2
            ['template_id' => '3', 'slug' => 'portfolio'], //3
            ['template_id' => '4', 'slug' => 'team'], //4
            ['template_id' => '5', 'slug' => 'library'], //5
            ['template_id' => '6', 'slug' => 'about'], //7
            ['template_id' => '7', 'slug' => 'contact'], //6
            ]);

        DB::table('fields')->insert([
            ['page_id' => '1', 'name' => 'عن مؤسسه الشعلان', 'value' => 'لقد اثرت التطورات الاقتصادية السريعة والمتلاحقة علي قرارات العديد من المستثمرين سواء علي مستوي الأسواق المحلية او علي مستوي الأسواق الإقليمية وكان لزاما علينا ايمانا منا بدور المستثمرين في التنمية الاقتصادية الشاملة للمجتمعات ان نقوم بتكريس مجموعة من الخبراء والمستشارين الاقتصاديين للوقوف علي هذه المتغيرات ودراسة سلوكها وتاثيراتها علي قرارات المستثمر 
            
            لذا ومن اجل قرار استثماري رشيد قائم علي أسس علمية واقتصادية واقعية قامت الشعلان للإستشارات الرائدة فى مجالات دراسات الجدوى و خطط الأعمال في مصر ودول الخليج العربي بما لديها من موارد بشرية خبيرة في القطاعات الاقتصادية المختلفة الصناعية والتجارية والزراعية والخدمية والعقارية بتدشين اكبر فريق استشاري في مصر والشرق الأوسط ويساند مؤسسة الشعلان من الظهير التسويقي شركة مها كود للبرمجيات والتسويق الالكتروني .', 'category' => ''],
            ['page_id' => '1', 'name' => 'رؤيتنا', 'value' => 'الريادة في مجال الاستشارات الاقتصادية والمرجع الأفضل على مستوى الوطن العربي لتقديم الحلول والاستشارات الاقتصادية المتطورة طبقا لأحدث الأساليب والأدوات العلمية .', 'category' => ''],
            ['page_id' => '1', 'name' => 'رسالتنا', 'value' => 'تعزيز القرار الاستثماري لرجال الاعمال واتخاذ القرار الرشيد طبقا لحقائق مجتمع الاعمال', 'category' => ''],
            ['page_id' => '1', 'name' => '', 'value' => '', 'category' => 'services'],
            ['page_id' => '1', 'name' => '', 'value' => '', 'category' => 'portfolio'],
            ['page_id' => '1', 'name' => '', 'value' => '', 'category' => 'team'],


            ['page_id' => '2', 'name' => '', 'value' => '', 'category' => 'services'],
            ['page_id' => '3', 'name' => '', 'value' => '', 'category' => 'portfolio'],
            ['page_id' => '4', 'name' => '', 'value' => '', 'category' => 'team'],
            ['page_id' => '5', 'name' => '', 'value' => '', 'category' => 'library'],


            ['page_id' => '6', 'name' => 'عن مؤسسه الشعلان', 'value' => 'لقد اثرت التطورات الاقتصادية السريعة والمتلاحقة علي قرارات العديد من المستثمرين سواء علي مستوي الأسواق المحلية او علي مستوي الأسواق الإقليمية وكان لزاما علينا ايمانا منا بدور المستثمرين في التنمية الاقتصادية الشاملة للمجتمعات ان نقوم بتكريس مجموعة من الخبراء والمستشارين الاقتصاديين للوقوف علي هذه المتغيرات ودراسة سلوكها وتاثيراتها علي قرارات المستثمر 
            
            لذا ومن اجل قرار استثماري رشيد قائم علي أسس علمية واقتصادية واقعية قامت الشعلان للإستشارات الرائدة فى مجالات دراسات الجدوى و خطط الأعمال في مصر ودول الخليج العربي بما لديها من موارد بشرية خبيرة في القطاعات الاقتصادية المختلفة الصناعية والتجارية والزراعية والخدمية والعقارية بتدشين اكبر فريق استشاري في مصر والشرق الأوسط ويساند مؤسسة الشعلان من الظهير التسويقي شركة مها كود للبرمجيات والتسويق الالكتروني .', 'category' => ''],
            ['page_id' => '6', 'name' => 'رؤيتنا', 'value' => 'إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.', 'category' => ''],
            ['page_id' => '6', 'name' => 'رسالتنا', 'value' => 'إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.', 'category' => ''],
            ['page_id' => '6', 'name' => '', 'value' => '', 'category' => 'team'],
            ]);
    }
}
